app/Controllers/AnimalController.php

SELECT *
FROM `animals`
---
    public function getAnimals()
    {
        $animals = $this->animalModel->findAll();

SELECT *
FROM `animals`
WHERE `animals`.`id` = '2'
---
    public function getAnimal($id)
    {
        $animal = $this->animalModel->find($id);

DELETE FROM `animals`
WHERE `id` IN ('7')
---
    public function deleteAnimals($id)
    {
        if (!$id) {
            return $this->response->setJSON(['error' => 'ID not provided'])->setStatusCode(400);
        }

        $deleted = $this->animalModel->delete($id);