app/Controllers/AuthController.php

    public function login()
    {
        $data = $this->request->getPost();

        if (empty($data)) {
            $data = json_decode($this->request->getBody(), true);
        }

        log_message('info', 'Login payload: ' . json_encode($data));

        if (!$data || !isset($data['email']) || !isset($data['password'])) {
            return $this->response->setStatusCode(400)->setJSON([
                'status' => 'error',
                'message' => 'Email and password are required.',
            ]);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $data['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'yerrouihel@gmail.com'
 LIMIT 1